1. D
2. A
3. D
4. D
5. C
6. D
7. C
8. B
9. A,B,C,D
10. A,B,C,D

11.

In [39]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin','Jonas'],
 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['I','II','III','IV','V','VI','VII','VIII','IX','X']
df=pd.DataFrame(exam_data,index=labels)
df

           name  score  attempts qualify
I     Anastasia   12.5         1     yes
II         Dima    9.0         3      no
III   Katherine   16.5         2     yes
IV        James    NaN         3      no
V         Emily    9.0         2      no
VI      Michael   20.0         3     yes
VII     Matthew   14.5         1     yes
VIII      Laura    NaN         1      no
IX        Kevin    8.0         2      no
X         Jonas   19.0         1     yes

12.

In [10]:
print("First 5 rows of df")
print(df.iloc[:5])

First 5 rows of df
          name  score  attempts qualify
I    Anastasia   12.5         1     yes
II        Dima    9.0         3      no
III  Katherine   16.5         2     yes
IV       James    NaN         3      no
V        Emily    9.0         2      no

13.

In [21]:
print("Name and Score columns of df")
print('\n')
print(df.iloc[0:-1,0:2])

Name and Score columns of df


           name  score
I     Anastasia   12.5
II         Dima    9.0
III   Katherine   16.5
IV        James    NaN
V         Emily    9.0
VI      Michael   20.0
VII     Matthew   14.5
VIII      Laura    NaN
IX        Kevin    8.0

14.

In [23]:
print(df.iloc[[3,5,6,8],[1,2]])

     score  attempts
IV     NaN         3
VI    20.0         3
VII   14.5         1
IX     8.0         2

15.

In [37]:
print("Rows where score between 15 and 20 (inclusive):")
df[df['score'].between(15,20)]

Rows where score between 15 and 20 (inclusive):

          name  score  attempts qualify
III  Katherine   16.5         2     yes
VI     Michael   20.0         3     yes
X        Jonas   19.0         1     yes